MESSAGES = {
    # Меню и добавление книги
    "start_menu": "Добро пожаловать в нашу электронную библиотеку! Ниже представлены доступные команды, для продолжения - введите соответствующую цифру:\n\
            1 - Добавить книгу\n\
            2 - Удалить книгу\n\
            3 - Найти книгу\n\
            4 - Отобразить все книги\n\
            5 - Изменить статус книги по id\n\
            6 - Выйти\n",
    "search_menu": "Выберите параметр поиска:\n\
            1 - Искать по названию\n\
            2 - Искать по автору\n\
            3 - Искать по году издания\n",
    "add_book_title": "Введите название книги:\n",
    "add_book_author": "Введите автора книги:\n",
    "add_book_year": "Введите год издания книги:\n",
    "status_info": "Доступно два статуса. Введите соответствующую цифру:\n\
                    1 = в наличии\n\
                    2 = выдана\n",
    "status_default": "в наличии",
    "status_no_available": "выдана",
    "type_book_ID": "Введите ID книги:\n",
    "status": "Статус",
    "author": "Автор",
    "title": "Название",
    "year": "Год издания",
    "id": "id",
    # Поиск
    "searching_title": "Напишите название книги:\n",
    "searching_author": "Напишите автора книги:\n",
    "searching_year": "Напишите год издания книги:\n",
    # изменение
    "change_book_info": "Статус у книги изменяется по ID. Если вы не помните ID, рекомендуем вывести весь список книг.",
    "change_book_confirmation": "Вы действительно хотите изменить статус у книги? Если да, нажмите 1, если нет - любую кнопку.\n",
    # Удаление
    "delete_book_info": "Книги удаляются по ID. Если вы не помните ID, рекомендуем вывести весь список книг.",
    "delete_book_confirmation": "Вы действительно хотите удалить книгу? Если да, нажмите 1, если нет - любую кнопку.\n",
    # Ошибки
    "file_not_found_error": "К сожалению библиотека еще не создана.",
    "book_not_found_error": "Книга не найдена.\nПроверьте параметры поиска.",
    "command_not_exist": "Вы ввели не существующую команду",
    "id_not_exist": "Вы ввели не существующий ID",
    # Выход
    "exit_message": "Спасибо за ваш визит! Ждем вас еще!",
}
